# Import Libraries

In [1]:
import pandas as pd
import numpy as np
import os

# Import Datasets

In [2]:
path=(r'C:\Users\Admin\Desktop\Data Tasks\Data Immersion\Achievement 4\Instacart Basket Analysis\02 data')

In [3]:
#importing products
df_prods=pd.read_csv(os.path.join(path,'Prepared Data','df_prods_clean.csv'),index_col=0)

# #Reduce Memory Used
df_prods

In [4]:
#checking the memory usage before changing the dtype
df_prods.info()

<class 'pandas.core.frame.DataFrame'>
Index: 49672 entries, 0 to 49692
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   product_id     49672 non-null  int64
 1   product_name   49672 non-null  object
 2   aisle_id       49672 non-null  int64
 3   department_id  49672 non-null  int64
 4   prices         49672 non-null  float64
dtypes: float64(1), int64(3), object(1)
memory usage: 2.3+ MB

In [5]:
#checking the max values to decide which dtype to assign
df_prods.describe()

         product_id      aisle_id  department_id        prices
count  49672.000000  49672.000000   49672.000000  49672.000000
mean   24850.349775     67.762442      11.728942      9.993282
std    14340.705287     38.315784       5.850779    453.615536
min        1.000000      1.000000       1.000000      1.000000
25%    12432.750000     35.000000       7.000000      4.100000
50%    24850.500000     69.000000      13.000000      7.100000
75%    37268.250000    100.000000      17.000000     11.100000
max    49688.000000    134.000000      21.000000  99999.000000

In [6]:
#changing the dtype
df_prods['product_id']=df_prods['product_id'].astype('int32')
df_prods['aisle_id']=df_prods['aisle_id'].astype('int16')
df_prods['department_id']=df_prods['department_id'].astype('int8')
df_prods['prices']=df_prods['prices'].astype('float32')

In [7]:
#checking the memory usage after changing the dtype
df_prods.info()

<class 'pandas.core.frame.DataFrame'>
Index: 49672 entries, 0 to 49692
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   product_id     49672 non-null  int32
 1   product_name   49672 non-null  object
 2   aisle_id       49672 non-null  int16
 3   department_id  49672 non-null  int8
 4   prices         49672 non-null  float32
dtypes: float32(1), int16(1), int32(1), int8(1), object(1)
memory usage: 1.3+ MB

# Direction 3
#### In a new notebook, import the orders_products_combined dataframe from the pickle file you just saved.

In [8]:
#importing orders_products_combined
orders_products_combined=pd.read_pickle(os.path.join(path,'Prepared Data','orders_products_combined.pkl'))

# Direction 4
#### Check the shape of the imported dataframe (it should be the same as the one you exported—always check!).

In [9]:
orders_products_combined.shape

(32434489, 10)

# Direction 5
#### Determine a suitable way to combine the orders_products_combined dataframe with your products data set. Make sure you’re using your wrangled, cleaned, and deduped products data set stored in your “Prepared Data” folder from the previous Exercise’s task.

In [10]:
#overviewing df orders_products_combined
orders_products_combined.head()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered,_merge
0,2539329,1,1,2,8,NaN,196,1,0,both
1,2539329,1,1,2,8,NaN,14084,2,0,both
2,2539329,1,1,2,8,NaN,12427,3,0,both
3,2539329,1,1,2,8,NaN,26088,4,0,both
4,2539329,1,1,2,8,NaN,26405,5,0,both

In [11]:
#dropping cloumn merge
orders_products_combined=orders_products_combined.drop(columns=['_merge'])

In [12]:
#viewing orders_products_combined
orders_products_combined.head()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered
0,2539329,1,1,2,8,NaN,196,1,0
1,2539329,1,1,2,8,NaN,14084,2,0
2,2539329,1,1,2,8,NaN,12427,3,0
3,2539329,1,1,2,8,NaN,26088,4,0
4,2539329,1,1,2,8,NaN,26405,5,0

In [13]:
#overviewing df products
df_prods.head()

,product_id,product_name,aisle_id,department_id,prices
0,1,Chocolate Sandwich Cookies,61,19,5.8
1,2,All-Seasons Salt,104,13,9.3
2,3,Robust Golden Unsweetened Oolong Tea,94,7,4.5
3,4,Smart Ones Classic Favorites Mini Rigatoni Wit...,38,1,10.5
4,5,Green Chile Anytime Sauce,5,13,4.3

In [14]:
#checking dimensions for df products
df_prods.shape

(49672, 5)

In [15]:
#merging df_prods with orders_products_combined
orders_products_merged=orders_products_combined.merge(df_prods,on='product_id', indicator=True)

In [16]:
orders_products_merged.shape

(32404859, 14)

In [17]:
#overviewing df orders_products_merged
orders_products_merged.head()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered,product_name,aisle_id,department_id,prices,_merge
0,2539329,1,1,2,8,NaN,196,1,0,Soda,77,7,9.0,both
1,2398795,1,2,3,7,15.0,196,1,1,Soda,77,7,9.0,both
2,473747,1,3,3,12,21.0,196,1,1,Soda,77,7,9.0,both
3,2254736,1,4,4,7,29.0,196,1,1,Soda,77,7,9.0,both
4,431534,1,5,4,15,28.0,196,1,1,Soda,77,7,9.0,both

# Direction 6
#### Confirm the results of the merge using the merge flag.

In [18]:
#checking stats of merging
orders_products_merged['_merge'].value_counts()

_merge
both          32404859
left_only            0
right_only           0
Name: count, dtype: int64

# Direction 7
#### Export the newly created dataframe as orders_products_merged in a suitable format (taking into consideration the size).

In [19]:
orders_products_merged.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32404859 entries, 0 to 32404858
Data columns (total 14 columns):
 #   Column                  Dtype
---  ------                  -----
 0   order_id                int32
 1   user_id                 int32
 2   order_number            int8
 3   orders_day_of_week      int8
 4   order_hour_of_day       int8
 5   days_since_prior_order  float16
 6   product_id              int32
 7   add_to_cart_order       int32
 8   reordered               int8
 9   product_name            object
 10  aisle_id                int16
 11  department_id           int8
 12  prices                  float32
 13  _merge                  category
dtypes: category(1), float16(1), float32(1), int16(1), int32(4), int8(5), object(1)
memory usage: 1.1+ GB

In [20]:
#exporting as pkl to save memory usage
orders_products_merged.to_pickle(os.path.join(path,'Prepared Data','orders_products_merged.pkl'))